/*Визначити клас "Трикутник", членами якого є координати вершин трикутникав просторі.
Реалізувати для нього декілька конструкторів, геттери, методи обчислення периметра трикутника.
Перевантажити оператори : префіксний "++" / постфіксний "++" - для 
інкрементування усіх х - координат і усіх у - координат вершин трикутника відповідно, 
"+=" для збільшения усіх координат вершин трикутника на вказану величину.

Створити три трикутника(Т1, Т2, Т3), використовуючи різні конструктори.
Інкрементувати х - координати вершин трикутника Т1 i у - координати вершин трикутника Т2
Збільшити координати вершин трикутника ТЗ на вказану величину.
Серед трикутників Т1, Т2, Т3 визначити трикутник, що має найбільший периметр */

#include <iostream>
#include "classTriangle.h"

using namespace std;

int main() {
	Triangle T1;
	T1.setX1(23);
	T1.setY3(92);
	
	Triangle T2(199, 1, 0, 1, 23,7);
		
	Triangle T3 = T1;
	T3.setY1(12);
	T3.setY2(40);

	T1.printTriangle("T1");
	++T1;
	T1.printTriangle("T1");
	cout << endl;
	
	T2.printTriangle("T2");
	T2++;
	T2.printTriangle("T2");
	cout << endl;

	T3.printTriangle("T3");
	T3+=2.5;
	T3.printTriangle("T3");
	cout << endl;

	findMaxTriangle(T1, T2, T3);

	return 0;
}